[
  {
    "date": "2024-11-21",
    "speaker": "Candice Price (Smith College)",
    "speakerurl": "https://www.candicerprice.com/",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "title": "Unravelling Biochemistry Mysteries: Knot Theory Applied to Biochemistry",
    "abstract": " Mathematical modeling is an effective resource for biologists since it provides ways to simplify, study, and understand the complex systems common in biology and biochemistry. Many mathematical tools can be applied to biological problems, some traditional and some more novel, all innovative. This presentation will review the mathematical tools that I use to model and study biological issues of DNA-protein interactions.",
    "bio": "Candice Reneé Price, an esteemed African American mathematician, was born and raised in California. She has distinguished herself through contributions to mathematics through education and service. Growing up passionate about mathematics, Price earned her undergraduate degree (2003) in mathematics from California State University, Chico, and a master's degree (2007)  in mathematics from San Francisco State University.  She went on to complete her doctoral studies (2012) in mathematics at the University of Iowa, where her research focused on DNA Topology under the advisement of Dr. Isabel Darcy. Her published work now spans diverse areas of research including applied mathematics, mathematics of social justice, and discrete mathematics.  \n Beyond her research, Candice Price is known for her advocacy for diversity in STEM fields and her mentorship of aspiring mathematicians, particularly from underrepresented backgrounds. She has received numerous awards and honors for her contributions, including the 2022 Mathematics Association of America Inclusivity Award.  \n She remains a role model and inspiration, both as a distinguished mathematics educator and for her commitment to promoting inclusivity and diversity in the mathematics community"
  },
  {
    "date": "2024-09-25",
    "speaker": "Gabriel 'Gabe' Sosa Castillo (Colgate University)",
    "speakerurl": "https://www.lathisms.org/calendar-2020/gabriel-sosa",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "title": "Characterizing Reconstructible Monomial Orders.",
    "abstract": "When were are asked to write the polynomial $p(x)=3x^2 +x^4 +7-x$ in standard
form we know our answer is $x^4+3x^2-x+7$, because the only way to order powers of $x$ totally while being consistent with multiplication is the natural one: degree wise! Complexity is introduced when we are asked to write $q(x)=2x^3yz^2-6x^4z+x^2y^3z$ in standard form and we have to define what standard form means in this setting.

In this talk we will introduce the concept of Monomial Orders through examples, discuss the basics of their matrix representations, present the three classical monomial orders (lexicographic, degree lexicographic and reverse lexicographic) and explore a curious property they possess (hint: it is in the title), and present results found in joint work with undergraduates in 2016 and 2023 at Amherst College and Colgate University, respectively,  seeking to characterize other monomial orders possessing this 'reconstructible' property.

The only background needed for (most of) this talk is basic linear algebra!
",
    "bio": "Gabriel was born in Barranquilla, Colombia. His participation in International Mathematical Olympiads representing Colombia led him to pursue Mathematics as a career. He attended Universidad de Costa Rica (UCR) for his undergraduate work, he dropped out at the beginning of his junior year due to issues surrounding his coming out. He returned to college three years later and earned his B.S. in Mathematics while working full time as a high school math teacher and studying part time. In 2015 he earned his PhD from Purdue University in Computational and Combinatorial Commutative Algebra under the guidance of Giulio Caviglia, from 2015 to 2019 he worked as a Visiting Assistant Professor at Amherst College and is currently an Assistant Professor at Colgate University. "
  },
  {
    "date": "2024-10-02",
    "speaker": "Nathan Pflueger (Amherst College)",
    "speakerurl": "https://npflueger.github.io/",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "title": "Title TBA",
    "abstract": "Abstract TBA.",
    "bio":
  },
  {
    "date": "2024-04-17",
    "speaker": "Alanna Hoyer-Leitzel (Mt. Holyoke)",
    "speakerurl": "https://www.mtholyoke.edu/directory/faculty-staff/alanna-hoyer-leitzel",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "title": "Comparing models of disturbance in applied dynamical systems",
    "abstract": "Different choices for modeling disturbance to a dynamical system can lead to different predictions of future outcomes. For example, when modeling population growth, traditional techniques use a continuous disturbance to model removing part of the population. However, if the disturbance is relatively fast compared to the recovery period, we can choose to remove part of the population instantaneously in a type of impulsive differential equation that I like to call a flow-kick system. In this talk I'll introduce flow-kick systems and show that when maintaining a constant disturbance rate, flow-kick systems can have qualitatively different outcomes than their analogous continuous systems if the time between disturbances is large enough. I'll discuss some theory briefly but mainly focus on applications, including fires in savannas and human immune system reaction to reoccurring exposure to a virus.",
    "bio": "Alanna Hoyer-Leitzel is an Associate Professor Mathematics at Mount Holyoke College. Her research in dynamical systems focuses on bifurcations and disturbance, with applications in physical, ecological, and biological systems. She likes cats, small dogs, and dabbling in fiber arts and gardening."
  },
  {
    "date": "2024-03-27",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "speaker": "Jessica Sidman (Amherst)",
    "speakerurl": "https://jessicasidman.github.io/",
    "title": "Tensegrities: linear algebra as art?",
    "abstract": "Kenneth Snelson's beautiful tensegrity sculptures feature metal bars that seem to float magically in the air.  In this talk I'll try to convince you that a tensegrity is the physical manifestation of a linear dependence relation on the rows of a matrix.  Then I'll discuss how the mathematics used to describe tensegrities can also be used to study other disparate problems including sensor network localization, the rigidity of bar-and-joint frameworks, and the distributed control of formations of robots.",
    "bio": "Jessica Sidman loves to work on pure and applied problems at the intersection of computational algebra, algebraic geometry, and combinatorics. Her recent work in rigidity theory combines aspects of these three fields, and all got started when an undergraduate doing a thesis on protein folding asked her a question about projective space. She got her Ph.D. from the University of Michigan and did postdoctoral work at UC Berkeley and UMass Amherst.  She was the Professor of Mathematics on the John Stewart Kennedy Foundation at Mount Holyoke College and is now a Professor of Mathematics at Amherst College."
  },
  {
    "date": "2024-02-22",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "speaker": "Joe Kraisler (Amherst)",
    "speakerurl": "https://www.amherst.edu/people/facstaff/jkraisler",
    "title": " Factoring Integers Using Quantum Computers",
    "abstract": "Factoring large numbers is notoriously difficult, even with the help of a computer and state of the art algorithms. In fact, if you could factor large integers into their prime components efficiently, you could break the security systems that websites use to protect users' credit card information (and become quite rich). In 1994 Peter Shor developed an algorithm which runs on a \"quantum computer\" in \"polynomial time\". In this talk I will discuss what a quantum computer is, what basic logical operations it can perform, and use Shor's algorithm to factor the number 15. The talk will assume some basic facts from Linear Algebra.",
  },
  {
    "date": "2024-02-12",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk gathering at 3:30 in Williams Lounge (Room 208).",
    "title": "Beyond Fermat's last theorem",
    "abstract": "What do we (number theorists) do with ourselves now that Fermat's last theorem (FLT) has fallen? I'll discuss numerous generalizations of FLT  --  for instance, for fixed integers $a,b,c \\geq 2$ satisfying $1/a + 1/b + 1/c < 1$, Darmon and Granville proved the single generalized Fermat equation $x^a + y^b = z^c$ has only finitely many coprime integer solutions. Conjecturally something stronger is true: for $a,b,c \\geq 3$ there are no non-trivial solutions. More generally, I'll discuss my subfield \"arithmetic geometry\", and in particular the geometric intuitions that underlie the conjecture framework of modern number theory.",
    "speaker": "David Zureick-Brown (Amherst)",
    "speakerurl": "https://dmzb.github.io/",
    "bio": "David Zureick-Brown is a professor of mathematics at Amherst College. He is broadly interested in Number Theory, Arithmetic Geometry, and Algebraic Geometry, especially making connections between different subareas of mathematics."
  },
  {
    "date": "2024-04-03",
    "timeplace": "5:00-6:00, SMUD 206. Pre-talk gathering at 4:30 in Williams Lounge (Room 208).",
    "speaker": "Peyam Tabrizian (Brown)",
    "speakerurl": "https://sites.brown.edu/drpeyam/",
    "title": "It's all about Chemistry!",
    "abstract": "Have you ever wondered what a Partial Differential Equation (PDE) is and how it is used to model real life? In this talk, I will give two different PDE models for a chemical reaction and show that they are two different sides of the same coin. Come and see how a simple integration by parts makes all our worries go away! No math knowledge (beyond calculus) and no chemistry knowledge required.",
    "bio": "Peyam Tabrizian (he/him) is currently a Lecturer in the Applied Mathematics Department at Brown University. His speciality lies in the field of nonlinear partial differential equations, and his thesis work was on asymptotic methods for chemical reactions and diffusions. He also has a YouTube channel called \"Dr Peyam\" which currently has over 166,667 subscribers and close to 1000 videos."
  },
  {
    "date": "2023-10-16",
    "timeplace": "4:00-5:00, SCCE E110 (Lipton Lecture Hall)",
    "speaker": "Art Benjamin (Harvey Mudd College)",
    "title": "Art Benjamin: Mathemagician",
    "speakerurl": "https://math.hmc.edu/benjamin/",
    "abstract": "Dr. Benjamin, Professor of Mathematics at Harvey Mudd College, has performed his mixture of math and magic for audiences across the world. He’s appeared on the Colbert Report, Today, and NPR, and is profiled in NY Times, LA Times, USA Today, Scientific American, Discover, Esquire, People, and Wired magazines.

All are welcome and encouraged to attend this lively, fun event!"
  },
  {
    "date": "2023-09-20",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk refreshments at 3:45 in Room 208.",
    "speaker": "Rob Benedetto (Amherst)",
    "speakerurl": "https://rlbenedetto.people.amherst.edu/",
    "title": "The $abc$ Conjecture: An Introduction",
    "abstract": "The $abc$-conjecture is a straightforward statement about the prime factors of integers $a$, $b$, and $c$ satisfying the equation $a+b=c$. In spite of the simple name, simple equation, and simple statement, however, the conjecture turns out to be a quite subtle statement in number theory.

In this talk, we will motivate and state the $abc$-conjecture. To help us get there, we'll spend most of our time looking at the related case of putting polynomials, rather than integers, in the roles of $a$, $b$, and $c$.

No background beyond Math 111 is needed for this talk.",
    "bio": " Rob Benedetto has been a Professor of Mathematics at Amherst College since 2002. Previously, he held postdoctoral positions at the University of Rochester and Boston University. His research is in number theory and dynamical systems."
  },
  {
    "date": "2023-10-05",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk refreshments at 3:45 in Room 208.",
    "speaker": "Jake Levinson (Université de Montréal)",
    "bio": "Jake Levinson is an assistant professor of mathematics at the Université de Montréal. As an undergrad he attended Williams College (go Ephs!). He is interested in algebra, geometry and combinatorics.",
    "speakerurl": "https://dms.umontreal.ca/~levinsonj/",
    "title": "Curvature and polyhedra",
    "abstract": "What does it mean for a surface to be curved? One way to answer this question is in terms of triangles drawn on the surface, and there's a neat way to approach it for polyhedra -- surfaces with planar faces, like the cube and the octahedron. We'll explore this idea and also encounter an invariant called the Euler characteristic: a glimpse of the area of mathematics called topology."
  },
  {
    "date": "2023-11-14",
    "timeplace": "4:00-5:00, SMUD 206. Pre-talk refreshments at 3:45 in Room 208.",
    "speaker": "Geremias Polanco (Smith)",
    "speakerurl": "https://www.smith.edu/academics/faculty/geremias-polanco",
    "title": "On Numbers… and Patterns… and Games… and Greed",
    "abstract": "Two sequences are complementary if their union gives the positive integers and their intersection is empty. For instance, the even and odd numbers are two complementary sequences. Similarly, the prime and composite numbers form another pair of complementary sequences.
Combinatorial Games are two player (usually alternating), deterministic games (no flipping coins, tossing dice, ...) and with perfect information (each player knows all information available about the state of the game. Nothing is hidden). 
On the other hand continued fractions are a special type of fractions that form under the following rules: \"add a fraction to an existing fraction’s denominator.\" 
In this talk we will present some old and new results about complementary sequences, see how some of they arise as winning strategies for combinatorial games and how these sequences relate to continued fractions and other mathematical objects like dynamical systems.",
    "bio": "My name is Geremías Polanco and I am an Assistant Professor of Mathematics at Smith College. I obtained my PhD in Mathematics from the University of Illinois at Urbana-Champaign, and my area of specialization is Number Theory. In this area of mathematics we study the integers which are the numbers $\\cdots -3,-2,-1,0,1,2,3,\\cdots$
and their generalizations. My research uses tools from combinatorics (counting techniques), tools from algebra and tools from analysis (a sophisticated version of calculus) to solve problems involving the integers, and I actively mentor students in this endeavor.

To be more specific, I investigate number theoretic and combinatorial properties of complementary integer sequences, especially those that are increasing. My research spans analyzing their inherent properties, exploring various generation methods, examining related mathematical constructs, and applying them in areas such as combinatorial games where these sequences emerge as solutions. I also study problems in uniform distribution theory, a central area in mathematics, that provides a framework to understand how sequences spread out over a specific interval or space. Finally I am lately working on some problems that require the use of analysis and algebra to better understand prime numbers and their properties.

Professionally, I have three main passions:

1. I am passionate about engaging in collaborative research with students and other colleagues, particularly delving into intriguing challenges in number theory.
2. My enthusiasm lies in effective teaching and conveying mathematical concepts to diverse audiences, with a special emphasis on undergraduate students.
3. My ultimate aim is to contribute to the establishment of a more inclusive mathematics community by breaking down barriers that hinder access and by providing support to all individuals, enabling them to flourish within the field of mathematics.
I was born in the Dominican Republic where I completed my undergraduate studies. After completing my Phd I moved to the Pioneer Valley where I worked as an Assistant professor at Hampshire College for 6 years, as a Visiting Assistant Professor at Amherst College for 1 year, and I have been at Smith since 2020.  I love baseball (being a good dominican myself) and other outdoor activities.On Saturday nights, I am likely to be playing board games with my family and any friends that may join us."
  },
  {
    "date": "2023-11-01",
    "timeplace": "4:00-5:00",
    "speaker": "Leo Goldmakher (Williams)",
    "title": "A new characterization of characters (or: algebra and analysis can be friends!)",
    "abstract": "One of the fundamental concepts of analysis is the fourier transform, which translates information about a function into information about its frequencies. One of the fundamental concepts of algebra is the homomorphism, which translates information about one structured set into information about another structured set. While on the surface these two concepts are unrelated, Gauss discovered some connections between the two. In fact, it turns out that sometimes the two concepts carry equivalent information! Although the talk will include some results that are new, the main ideas should be accessible to all; in particular, I will introduce all the relevant concepts.",
    "speakerurl": "https://web.williams.edu/Mathematics/lg5/",
    "bio": "Prior to realizing that he could get paid to play with puzzles for his own amusement, Leo Goldmakher pursued a number of other careers--astronaut, paleontologist, singer songwriter--all before the age of 5. A string of outrageous oversights by admissions officers led him to obtain degrees from Princeton and the University of Michigan, after which he was inexplicably hired by the University of Toronto as a postdoc and, subsequently, assistant professor. In 2014 he joined the Williams math/stat department, and has been inflicting mathematics and unforgivable puns on students ever since. He is the recipient of numerous awards, primarily for participation in little league soccer, and is one of the most highly-regarded mathematicians in his household. His primary research interests remain largely unchanged since middle school: to discover and quantify structure and randomness within the natural numbers.",
  },
  {
    "date": "2023-11-09",
    "speaker": "Kate Moore (Amherst)",
    "speakerurl": "https://katherinemath.com/",
    "title": "Data Cohesion: From Similarity Comparisons to Clustering (joint Math/Stat colloquium)",
    "abstract": "We often want to observe the shape of our data and will use clustering and data visualization methods to do so.  These methods typically require that our data is described with respect to a relatively small set of variables or that we provide distances among all pairs of points.  For many interesting problems, however, this initial step can be quite challenging.  In such a case, we may instead wish to work from a set of responses to similarity comparisons (e.g., among x, y, and z, which one is the outlier?).  In this talk, I will introduce cohesion, a new measure of relative proximity that is built on this comparison framework.  We’ll see how cohesion offers a perspective on our data that is quite different from distance alone and can help address challenges that arise in high-dimensional settings.  I will also share some initial progress toward the development of cohesion-based methods for clustering and data visualization."
  },
  {
    "date": "2023-03-28",
    "timeplace": "4:30pm-5:30pm, Seeley Mudd 206",
    "speaker": "Ron Buckmire (Occidental)",
    "speakerurl": "https://www.oxy.edu/academics/faculty/ron-buckmire",
    "title": "Different Differences: A Primer on NSFD Methods For Solving Differential Equations",
    "abstract": "From Calculus we know that a derivative of a function can be approximated using a difference quotient. There are different forms of the difference quotient, such as the forward difference (most common), backward difference and centered difference (more accurate). In this talk I will discuss several different differences, specifically nonstandard finite differences (NFSD) that can be used to approximate the derivatives that appear in differential equations as a solution technique. Many NSFD schemes have been discovered and promoted by Ronald E. Mickens, an African-American Emeritus Professor of Physics at Clark Atlanta University, who has written more than 300 research articles and a dozen books. I will present a number of examples of how NSFD schemes can be used to solve a variety of problems drawn from first-semester Calculus to elementary ordinary differential equations to advanced partial differential equations.

All students (faculty and staff) are welcome to attend.  Only knowledge of elementary derivatives/anti-derivatives and Taylor approximations will be assumed."
  },
  {
    "date": "2022-11-02",
    "speaker": "Alejandro Morales (U. Mass)",
    "speakerurl": "https://sites.google.com/view/ahmorales/",
    "timeplace": "4:30-5:30, SMUD 206",
    "title" : "Recent advances in the study of flow polytopes of graphs",
    "abstract": "A flow polytope of a graph is the set of flows on the edges of the graph with prescribed net flows on vertices. Flow polytopes of graphs are a rich family of polytopes of interest in probability, optimization, representation theory, and algebraic combinatorics.
Special cases of these polytopes have remarkable formulas for their volume related to the famous Selberg integral. I will give an overview of recent work on these polytopes including formulas that relate their volume to the number of lattice points, and the geometry of their
triangulations."
  },
  {
    "date": "2022-10-26",
    "speaker": "Johan VanHorebeek (CIMAT)",
    "speakerurl": "https://www.cimat.mx/~horebeek/",
    "timeplace": "4:30 PM, SMUD 206",
    "title": "A guided walk through object oriented statistical machine learning",
    "abstract": "Usually, we treat data as vectors stored in an excel sheet or data matrix. In this talk we navigate attendees through a spectrum of challenging problems in data science and machine learning that show the need for more sophisticated approaches. We briefly discuss some (recent) mathematical and statistical aspects and the central role of distance and similarity functions."
  },
  {
  "date": "2021-03-18",
  "timeplace": "5:30pm-6:30pm, via Zoom",
  "speaker": "Dan Velleman (Professor Emeritus, Amherst College)",
  "speakerurl": "https://www.amherst.edu/people/facstaff/djvelleman",
  "title": "The Mystery of Colliding Blocks",
  "abstract": "I will solve a simple physics problem with a very surprising answer."
  },
{
  "date": "2021-04-01",
  "timeplace": "5:30pm-6:30pm, via Zoom",
  "speaker": "Bowen Wang (2018 Amherst graduate)",
  "title": "Towards a coarse theory of quantum spin systems",
  "abstract": "In this talk, we will explore two very different worlds: the world of quantum spin systems and the world of coarse geometry. Quantum spin systems are powerful mathematical models of interacting quantum many-body systems. They are widely studied in condensed matter physics, mathematical physics as well as quantum information theory. On the other hand, since its introduction by John Roe, coarse geometry has remained a beautiful and effective description of large-scale behavior of spaces. After introducing both worlds separately, I will explain an on-going effort to connect the two through an idea called homology. I will only assume backgrounds in calculus and linear algebra."
},  
{
  "date": "2020-09-29",
  "timeplace": "5:30pm-6:30pm, via Zoom",
  "speaker": "Patricia Cahn (Smith College)",
  "title": "Wallpaper Patterns and Life on the Klein Bottle",
  "abstract": "Wallpaper patterns are patterns in the plane which repeat forever in two directions (say, horizontally and vertically, the way wallpaper does!). We'll study their classification using ideas from geometry, and a related field, topology, which one can think of as 'flexible geometry'. We'll encounter many fun mathematical objects along the way, including donuts, Mobius bands, and Klein bottles!"
},
{
  "date": "2020-09-15",
  "timeplace": "6:00pm-7:00pm, via Zoom",
  "speaker": "Ivan Contreras (Amherst)",
  "title": "Stranger Things (in Math)",
  "abstract": "As most of you know, 'Stranger Things' is a popular series on Netflix, in which the main characters explore the unknown 'Upside Down' world, where things don't work as they usually do. Following the analogy, we will explore a non-commutative version of algebra and geometry, in which the order in which you write your variables matter. For example, usual addition and multiplication are commutative operations, but subtraction, division, and composition of functions are non-commutative. We will introduce some 'non-commutative creatures' and we will delve into two interesting results: the Baker-Campbell-Hausdorff formula and the Gelfand-Naimark theorem, in an alternate non-commutative world."
},
{
  "date": "2019-10-24",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "David Freund (Harvard University)",
  "title": "Knot for Everyday Purposes",
  "abstract": "Knots are a part of our everyday lives, from twisted strands of DNA, to shoelaces, braided hair, and the inevitable tangle of headphones. Mathematics offers an insight into the structure and complexity of everyday knots and provides tools to tell them apart. Starting with pieces of string, we will explore the study of knots and how it ties together various fields of mathematics. No background knowledge is assumed."
},
{
  "date": "2019-09-26",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "Ivan Contreras (Amherst)",
  "title": "Mathematical Physics and the Shape of Graphs",
  "abstract": "Quantum Mechanics has revolutionized the way we understand our world. Since the beginning of the 20th century, beautiful mathematics has been devised and implemented in order to achieve such success. This talk intends to give a gentle overview of a discrete model of quantum mechanics: the Schrödinger equation on graphs. We will use the combinatorial graph Laplacian to learn about certain properties of finite graphs. No prior knowledge of physics or graph theory will be assumed."
},
{
  "date": "2019-10-10",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "Rob Benedetto (Amherst)",
  "title": "A Beginner's Introduction to the Mandelbrot Set",
  "abstract": "The Mandelbrot Set is a beautiful and intricate geometric object, a small portion of which appears as the background image of the Department's webpage. It arises naturally in the field of Complex Dynamics, the study of the behavior of a function when you compose it with itself over and over again, when the variable is a complex number. In this talk, I'll describe the basics of complex dynamics, as well as some of the fractal sets that arise along the way. That will lead to considering the Mandelbrot set, and exhibiting some of its special structures. The only background required is Math 121. No prior knowledge of dynamics, fractals, or complex numbers is needed."
},
{
  "date": "2019-11-06",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "Annie Raymond (UMass Amherst)",
  "title": "Turán's Problem and an Introduction to Sums of Squares",
  "abstract": "What is the maximum number of edges in a graph on n vertices without triangles? Mantel's answer in 1907—that at most half of the edges can be present—started a new field: extremal combinatorics. More generally, what is the maximum number of edges in a n‐vertex graph that does not contain any subgraph isomorphic to H? What about if you consider hypergraphs instead of graphs? I will introduce the technique of sums of squares and discuss how it can be used to attack such problems."
},
{
  "date": "2020-02-20",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "Amanda Folsom (Amherst)",
  "title": "Symmetry, Almost",
  "abstract": "Some definitions of the word symmetry include 'correct or pleasing proportion of the parts of a thing,' 'balanced proportions,' and 'the property of remaining invariant under certain changes, as of orientation in space.' One might think of snowflakes, butterflies, and our own faces as naturally symmetric objects– or at least close to it. Mathematically one can also conjure up many symmetric objects: even and odd functions, fractals, certain matrices, and modular forms, a type of symmetric complex function. All of these things exhibit a kind of beauty in their symmetries, so would they lose some of their innate beauty if their symmetries were altered? Alternatively, could some measure of beauty be gained with slight symmetric imperfections? We will explore these questions guided by the topic of modular forms and their variants. What can be gained by perturbing modular symmetries in particular? We will discuss this theme from past to present: the origins of these questions have their roots in the first half of the 20th century, dating back to Ramanujan and Gauss, while some fascinating and surprising answers come from just the last 15 years."
},
{
  "date": "2020-02-06",
  "timeplace": "4:30pm, Seeley Mudd 207",
  "speaker": "James M. Murphy (Tufts University)",
  "title": "Unsupervised Clustering, Harmonic Analysis, and Applications",
  "abstract": "Machine learning is revolutionizing the sciences. But, most existing methods require large amounts of human-generated training data to succeed. In this talk, we will introduce the unsupervised clustering problem, which requires an algorithm to make predictions without training data. We will discuss some classical methods for clustering before introducing a couple new approaches. Throughout, connections with graph theory, Fourier analysis, and probability theory will be developed. We will also demonstrate applications to image processing and remote sensing."
},
{
  "date": "2019-11-21",
  "timeplace": "4:30pm, Seeley Mudd 206",
  "speaker": "Kasso Okoudjou (U. Maryland)",
  "title": "A fun optimization problem",
  "abstract": "For any set of three vectors $U = \\left\\{ u_1, u_2, u_3 \\right\\} = \\left\\{ \\begin{bmatrix} 1 \\\\ 0 \\end{bmatrix} , \\begin{bmatrix} \\cos \\theta_1 \\\\ \\sin \\theta_1 \\end{bmatrix} , \\begin{bmatrix} \\cos \\theta_2 \\\\ \\sin \\theta_2 \\end{bmatrix} \\right\\}$ where the variables $ \\theta_1, \\theta_2 $ are in the interval $ [0, 2\\pi], $ we define the function $$ f(\\theta_1, \\theta_2) = \\sum_{k \\neq l = 1}^{3} (u_k \\cdot u_l)^2 \\cos^2(\\theta_1) + \\cos^2(\\theta_2) + \\cos^2(\\theta_2 - \\theta_1). $$ What is the minimum of this function over the set of all three unit-norm vectors in the plane? What is/are the corresponding minimizer(s)? Using multivariable calculus, we will answer these questions and explore some of the properties of the solution(s). We will then try to see how the solution changes when we have $ 4, 5, \\dots, N $ vectors instead of 3."
},
{
  "date": "2019-11-14",
  "timeplace": "4:30pm-5:30pm, SMUD 204",
  "speaker": "Katie Kinnaird (Smith College)",
  "title": "Comparing Songs without Listening: From Mathematics, Statistics, and Computer Science to Music and Back Again",
  "abstract": "Music is deeply entrenched in our daily lives, from our playlists to the background songs in our favorite television shows. The multidisciplinary field of Music Information Retrieval (MIR) is motivated by the comparisons that we, as humans, make about music and the various contexts of these comparisons. By defining tasks such as building better song recommendation systems or finding structural information in a given recording, MIR seeks to algorithmically make these musical comparisons in the same manner that a human being would, but on a much larger scale. In this talk, we will introduce the field of MIR, including popular tasks and cutting edge techniques. Then we will present aligned hierarchies, a structure-based representation that can be used for comparing songs, and new extensions of aligned hierarchies that leverage ideas from topological data analysis."
},
]
